# setup
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "argon/mas"
tap "c-bata/kube-prompt"
tap "facebook/fb"
tap "heroku/brew"
tap "neovim/neovim"
tap "rcmdnk/file"
tap "sanemat/font"
tap "homebrew/cask-fonts"

brew "git"
brew "bash"
brew "ghq"
brew "tig"
brew "fzf"

cask "karabiner-elements"
cask "slack"
cask "alfred"

brew "bash-completion"
brew "gh"
brew "mas"

brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"

brew "readline", link: true
brew "cmake"
brew "crf++"
brew "freetype"
brew "gettext"
brew "gawk"
brew "gdb"
brew "gnupg"
brew "ideviceinstaller"
brew "ios-deploy"
brew "jq"
brew "lua"
brew "luajit"
brew "nmap"
brew "pkg-config"
brew "reattach-to-user-namespace"
brew "rename"
brew "translate-shell"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "z"
brew "rcmdnk/file/brew-file"
brew "sanemat/font/ricty"
brew "fontforge"

cask "cheatsheet"
cask "kap"
cask "clipy"

brew "osquery"
brew "diff-so-fancy"
brew "git-delta"
brew "curl"

cask "android-studio"
cask "android-sdk"

cask "google-chrome"
brew "neovim", args: ["HEAD"]


cask "bettertouchtool"
mas "iMovie", id: 408981434
mas "BetterSnapTool", id: 417375580
mas "Keynote", id: 409183694

mas "Spark", id: 1176895641 # Email

mas "Xcode", id: 497799835
mas "1Password 7", id: 1333542190
brew "ctags"
cask 'font-hack-nerd-font'

# 各種便利コマンド系
brew 'bat'
brew 'exa'
brew 'fd'
brew 'ripgrep'
brew 'procs'
brew 'hyperfine'
brew 'bandwhich'

cask "docker"
brew "docker-compose"

cask "iterm2"
brew "tmux"
cask "alacritty"
cask "hyper"
cask "clipy"


cask "hyperswitch"

cask "sublime-text"
